# Taps (additional repositories)
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# =================
# SYSTEM TOOLS
# =================

# Basic system utilities
brew "wget"
brew "curl"
brew "tree"
brew "htop"
brew "jq"
brew "unzip"
brew "zip"

# Git and version control tools
brew "git"
brew "gh"               # GitHub CLI

# =================
# DEVELOPMENT
# =================

# Programming languages
brew "node"
brew "python3"
brew "go"
# brew "rust"
# brew "java"

# Development tools
brew "vim"
brew "docker"
# brew "docker-compose"
# brew "kubectl"

# Databases
# brew "postgresql"
# brew "mysql"
# brew "redis"

# =================
# APPLICATIONS
# =================

# Browsers
cask "google-chrome"
# cask "firefox"

# Code editors
cask "visual-studio-code"
# cask "sublime-text"

# Terminal
cask "iterm2"

# Development tools
cask "docker"
# cask "postman"
# cask "github-desktop"

# =================
# FONTS
# =================

cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-source-code-pro"

# =================
# PRODUCTIVITY
# =================

# cask "slack"
# cask "discord"
# cask "zoom"
# cask "notion"
# cask "obsidian"

# =================
# MULTIMEDIA
# =================

# cask "spotify"
# cask "vlc"
# cask "imageoptim"

# =================
# UTILITIES
# =================

# cask "the-unarchiver"
# cask "appcleaner"
# cask "rectangle"        # Window manager
# cask "alfred"           # Application launcher

# =================
# CUSTOM CONFIGURATION
# =================
# Add your specific tools here by uncommenting or adding new lines
